In [1]:
import pandas as pd

In [6]:
import pycountry

def get_country_name_from_code(code):
    try:
        country = pycountry.countries.get(alpha_3=code)
        return country.name
    except AttributeError:
        return "Unknown"
df=pd.read_csv("arrivals_soe.csv")

In [139]:
import pycountry

def get_country_name_from_code2(code):
    try:
        # Attempt to get country using alpha_2 code
        country = pycountry.countries.get(alpha_2=code)
        if country:
            return country.name
        else:
            return "Unknown"
    except LookupError:
        # Return "Unknown" for invalid codes
        return "Unknown"
    except Exception as e:
        # Log or print the exception for debugging
        print(f"Error: {e}")
        return "Unknown"

In [140]:
lst=[]
df = df.rename(columns={'country': 'code'})
for a in df["code"]:
    b=get_country_name_from_code(a)
    lst.append(b)
df["country"]=lst

In [142]:
df2=df2.drop(columns="Country")
df2=df2.drop(columns="Code")

In [143]:
joined=pd.merge(df, df2, on="country", how="inner")

In [146]:
joined.to_csv('final file.csv', index=False)

In [3]:
final=pd.read_csv("final file.csv")

In [7]:
final['date'] = pd.to_datetime(final['date'])
final['date'] = final['date'].dt.strftime('%b %Y')

In [11]:
# Assuming 'final' is your DataFrame
grouped_df = final.groupby(["date", "code", "soe"]).sum().reset_index()

In [20]:
filtered_df = grouped_df[grouped_df['arrivals'] > 0]

In [21]:
filtered_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 34457 entries, 35 to 87686
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             34457 non-null  object
 1   code             34457 non-null  object
 2   soe              34457 non-null  object
 3   arrivals         34457 non-null  int64
 4   arrivals_male    34457 non-null  int64
 5   arrivals_female  34457 non-null  int64
 6   country          34457 non-null  object
 7   latitude         34457 non-null  float64
 8   longitude        34457 non-null  float64
dtypes: float64(2), int64(3), object(4)
memory usage: 2.6+ MB

In [3]:
filtered_df.to_csv("grouped_arrivals.csv")

NameError: name 'filtered_df' is not defined

In [22]:
grouped_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87687 entries, 0 to 87686
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             87687 non-null  object
 1   code             87687 non-null  object
 2   soe              87687 non-null  object
 3   arrivals         87687 non-null  int64
 4   arrivals_male    87687 non-null  int64
 5   arrivals_female  87687 non-null  int64
 6   country          87687 non-null  object
 7   latitude         87687 non-null  float64
 8   longitude        87687 non-null  float64
dtypes: float64(2), int64(3), object(4)
memory usage: 6.0+ MB

In [4]:
a=pd.read_csv("grouped_arrivals.csv")

In [25]:
import pandas as pd

# Load the Big Mac Index dataset
url_big_mac = "https://raw.githubusercontent.com/TheEconomist/big-mac-data/refs/heads/master/source-data/big-mac-source-data-v2.csv"
bigmac = pd.read_csv(url_big_mac)

# Load your own dataset
url_your_dataset = "path_to_your_dataset.csv"

# Filter the Big Mac dataset for the year 2023
bigmac= bigmac[bigmac['date'].str.contains('2023')]
a=pd.read_csv("grouped_arrivals.csv")
a= a[a['date'].str.contains('2023')]

# Rename the column in the Big Mac dataset
bigmac= bigmac.rename(columns={"iso_a3": "code"})
bigmac["adjust_price"]=bigmac["local_price"]/bigmac["dollar_ex"]

In [26]:
a=pd.read_csv("grouped_arrivals.csv")
a= a[a['date'].str.contains('2023')]
summed = a.groupby(["code"]).sum()[["arrivals"]]
summed = summed.reset_index()
summed.columns = ['code', 'arrivals']

In [33]:
md = pd.merge(summed, bigmac, on="code")
md = md.iloc[1::2]
md.to_csv("bubbleChart_pictograph.csv")

In [34]:
md.head()

,code,arrivals,name,currency_code,local_price,dollar_ex,GDP_dollar,GDP_local,date,adjust_price
1,ARE,8475.0,United Arab Emirates,AED,18.00,3.67305,52625.126,193265.777,2023-07-01,4.900559
3,ARG,6162.0,Argentina,ARS,1650.00,275.27500,13640.410,1782994.200,2023-07-01,5.994006
5,AUS,409096.0,Australia,AUD,7.45,1.48401,65574.862,94358.390,2023-07-01,5.020183
7,AUT,14358.0,Austria,EUR,4.81,0.90699,52483.930,49800.808,2023-07-01,5.303256
9,AZE,1712.0,Azerbaijan,AZN,5.95,1.70250,7822.589,13298.401,2023-07-01,3.494860

In [13]:
summed.head()

      arrivals
code
AFG      684.0
AGO       78.0
AIA        1.0
ALB      627.0
AND       88.0

In [9]:
a.head()

,Unnamed: 0,date,code,soe,arrivals,arrivals_male,arrivals_female,country,latitude,longitude
877,5123,Apr 2023,AFG,Johor,2.0,2.0,0.0,Afghanistan,33.939110,67.709953
878,5124,Apr 2023,AFG,Kedah,1.0,1.0,0.0,Afghanistan,33.939110,67.709953
879,5127,Apr 2023,AFG,Sarawak,1.0,1.0,0.0,Afghanistan,33.939110,67.709953
880,5128,Apr 2023,AFG,Selangor,31.0,23.0,8.0,Afghanistan,33.939110,67.709953
881,5129,Apr 2023,AGO,Johor,2.0,0.0,2.0,Angola,-11.202692,17.873887

In [45]:
bigmac

,name,code,currency_code,local_price,dollar_ex,GDP_dollar,GDP_local,date,adjust_price
1946,United Arab Emirates,ARE,AED,18.00,3.67300,52625.126,1.932658e+05,2023-01-01,4.900626
1947,Argentina,ARG,ARS,980.00,184.69875,13640.410,1.782994e+06,2023-01-01,5.305937
1948,Australia,AUS,AUD,7.25,1.41854,65574.862,9.435839e+04,2023-01-01,5.110888
1949,Austria,AUT,EUR,4.48,0.91950,52483.930,4.980081e+04,2023-01-01,4.872213
1950,Azerbaijan,AZE,AZN,4.90,1.70250,7822.589,1.329840e+04,2023-01-01,2.878120
...,...,...,...,...,...,...,...,...,...
2083,Ukraine,UKR,UAH,105.00,36.93145,4582.609,1.481953e+05,2023-07-01,2.843105
2084,Uruguay,URY,UYU,259.00,37.76500,19737.342,8.125403e+05,2023-07-01,6.858202
2085,United States,USA,USD,5.58,1.00000,77191.871,7.719187e+04,2023-07-01,5.580000
2086,Vietnam,VNM,VND,74000.00,23687.50000,4101.730,9.600417e+07,2023-07-01,3.124011
2087,South Africa,ZAF,ZAR,49.90,17.78375,6684.479,1.093748e+05,2023-07-01,2.805932

In [78]:
import pandas as pd
gdp=pd.read_csv("gdp_capita.csv")

In [79]:
# Set row 3 (index 2) as the new header
gdp.columns = gdp.iloc[3]

# Drop the first 3 rows to clean up the DataFrame (including the row used as the new header)
gdp = gdp.drop([0, 1, 2, 3]).reset_index(drop=True)

In [80]:
gdp=gdp[["Country Code", 2023.0]]

In [81]:
gdp=gdp.rename(columns={"Country Code": "code", 2023.0: "gdp_capita"})

In [83]:

md = pd.merge(md, gdp, on="code", how="left")

In [84]:
md["gdp_capita"]=round(md["gdp_capita"])

In [85]:
md.head()

,name,code,currency_code,local_price,dollar_ex,GDP_dollar,GDP_local,date,adjust_price,arrivals,gdp_capita
0,United Arab Emirates,ARE,AED,18.00,3.67300,52625.126,193265.777,2023-01-01,4.900626,8475.0,52977.0
1,Argentina,ARG,ARS,980.00,184.69875,13640.410,1782994.200,2023-01-01,5.305937,6162.0,13731.0
2,Australia,AUS,AUD,7.25,1.41854,65574.862,94358.390,2023-01-01,5.110888,409096.0,64712.0
3,Austria,AUT,EUR,4.48,0.91950,52483.930,49800.808,2023-01-01,4.872213,14358.0,56506.0
4,Azerbaijan,AZE,AZN,4.90,1.70250,7822.589,13298.401,2023-01-01,2.878120,1712.0,7155.0

In [2]:
import pandas as pd

In [86]:
dist=pd.read_csv("https://raw.githubusercontent.com/rahulbot/distances-between-countries/refs/heads/master/distances.csv")

In [87]:
dist = dist.rename(columns={dist.columns[0]: 'code'})
dist=dist[["code", "MYS"]]
dist=dist.rename(columns={"MYS": "distance"})

In [88]:
dist

    code      distance
0    ABW  17772.198137
1    AFG   4627.929927
2    AGO  10012.910963
3    AIA  16872.110747
4    ALB   8930.954065
..   ...           ...
230  WSM   9748.630964
231  YEM   6411.044984
232  ZAF   9822.689546
233  ZMB   8491.259645
234  ZWE   8253.128523

[235 rows x 2 columns]

In [89]:
md = pd.merge(md, dist, on="code", how="left")

In [90]:
md["distance"]=round(md["distance"])

In [91]:
md.to_csv("bubbleChart_pictograph.csv")

In [2]:
import pandas as pd
subreg=pd.read_csv("subregion.csv")
md=pd.read_csv("grouped_arrivals.csv")

In [3]:
subreg=subreg[["alpha-3", "sub-region", "region"]]

In [4]:

subreg = subreg.rename(columns={"alpha-3": "code"})

In [5]:
md = pd.merge(md, subreg, on="code", how="left")

In [6]:
md = md.drop(columns=["Unnamed: 0"])

In [7]:
import pandas as pd
md = md.groupby(["date", "sub-region"])["arrivals"].mean().reset_index()

In [8]:
md["arrivals"]=round(md["arrivals"])
md.to_csv("streamgraph.csv")

In [10]:
import pandas as pd
md=pd.read_csv("streamgraph.csv")
reg=pd.read_csv("subregion.csv")

In [65]:
bigmac=pd.read_csv("bubbleChart_pictograph.csv")

In [66]:
bigmac=bigmac[["name", "adjust_price", "arrivals", "code"]]
bigmac_unique = bigmac.drop_duplicates(subset='code')

In [76]:
top_20_sorted = bigmac.sort_values(by='arrivals', ascending=False).head(30)
res = bigmac.sample(n=10, random_state=42)

In [81]:
a=top_20_sorted.drop_duplicates(subset=["name"], keep='last').sort_values(by="arrivals", ascending=False)

In [1]:
import pandas as pd
b=pd.read_csv("bubbleChart_pictograph.csv")

In [11]:
b["GDP_dollar"].max()

108438.547

In [2]:
import pandas as pd
a=pd.read_csv("streamgraph.csv")

     Unnamed: 0      date                 sub-region  arrivals
0             0  Apr 2020  Australia and New Zealand       6.0
1             1  Apr 2020               Eastern Asia      10.0
2             2  Apr 2020             Eastern Europe       2.0
3             3  Apr 2020            Northern Africa       3.0
4             4  Apr 2020           Northern America       6.0
..          ...       ...                        ...       ...
866         866  Sep 2023              Southern Asia    2825.0
867         867  Sep 2023            Southern Europe     159.0
868         868  Sep 2023         Sub-Saharan Africa      59.0
869         869  Sep 2023               Western Asia     163.0
870         870  Sep 2023             Western Europe     468.0

[871 rows x 4 columns]

In [3]:
import pandas as pd

# Creating a DataFrame with significant migration events of Eastern Europeans to Southeast Asia
data = {
    "Date": [
        "1990s",            # Post-Soviet Era
        "2000s to Early 2010s", # Economic growth and opportunities
        "2014",             # After Crimea annexation
        "2022",             # Russo-Ukraine War
    ],
    "Event": [
        "Post-Soviet migration begins as Eastern Europeans seek new opportunities abroad.",
        "Increased migration to Southeast Asia due to growing economies and job opportunities.",
        "Heightened migration from Ukraine due to conflict and instability.",
        "Surge in Ukrainian refugees fleeing the Russo-Ukraine War, seeking safety and stability.",
    ],
    "Region": [
        "Eastern Europe",
        "Eastern Europe",
        "Eastern Europe",
        "Eastern Europe",
    ],
    "Destination": [
        "Southeast Asia",
        "Southeast Asia",
        "Southeast Asia",
        "Southeast Asia",
    ]
}

# Creating the DataFrame
migration_df = pd.DataFrame(data)
migration_df

,Date,Event,Region,Destination
0,1990s,Post-Soviet migration begins as Eastern Europe...,Eastern Europe,Southeast Asia
1,2000s to Early 2010s,Increased migration to Southeast Asia due to g...,Eastern Europe,Southeast Asia
2,2014,Heightened migration from Ukraine due to confl...,Eastern Europe,Southeast Asia
3,2022,Surge in Ukrainian refugees fleeing the Russo-...,Eastern Europe,Southeast Asia

In [2]:
import pandas as pd

In [3]:
b=pd.read_csv("bumpchart.csv")

In [4]:
b.columns = b.iloc[0]
b = b[1:]

In [16]:
ranked_df = b.copy()
for year in b.columns[1:]:
    ranked_df[year] = b[year].rank(ascending=False, method='min')
ranked_df

,Destination Country,Origin Country,2016,2017,2018,2019,2020,2021,2022,2023
1,Brunei Darussalam,1.0,6.0,6.0,6.0,6.0,3.0,3.0,4.0,6.0
2,Cambodia,1.0,2.0,2.0,2.0,2.0,11.0,6.0,8.0,1.0
3,Indonesia,1.0,10.0,9.0,9.0,10.0,6.0,10.0,2.0,9.0
4,Lao PDR,1.0,3.0,4.0,3.0,3.0,2.0,NaN,11.0,3.0
5,Malaysia,1.0,5.0,7.0,7.0,7.0,5.0,8.0,10.0,5.0
6,Myanmar,1.0,7.0,5.0,5.0,4.0,1.0,9.0,6.0,11.0
7,Philippines,1.0,1.0,1.0,1.0,1.0,10.0,7.0,7.0,2.0
8,Singapore,1.0,8.0,8.0,8.0,8.0,9.0,2.0,1.0,7.0
9,Thailand,1.0,4.0,3.0,4.0,5.0,4.0,1.0,9.0,4.0
10,Viet Nam,1.0,11.0,11.0,10.0,9.0,7.0,4.0,5.0,8.0
11,ASEAN,1.0,9.0,10.0,11.0,11.0,8.0,5.0,3.0,10.0

In [33]:
import pandas as pd

In [34]:
df=pd.read_csv("arrivals_soe.csv")
sub=pd.read_csv("subregion.csv")

In [35]:
sub=sub[["alpha-3", "region", "sub-region"]]

In [36]:
sub.rename(columns={'alpha-3': 'country'}, inplace=True)

In [41]:
df = pd.merge(df, sub, on='country', how='inner')

In [42]:
sub_clean = df.drop_duplicates(subset=['date', 'country', 'soe', 'region'])

In [45]:
sub_clean.to_csv("arrivals_soe.csv")

In [53]:
dist=pd.read_csv("distances_to_malaysia.csv")
bub=pd.read_csv("bubbleChart_pictograph.csv")

In [74]:
dist=dist.rename(columns={'Origin': 'Country'}, inplace=True)

In [86]:
import pandas as pd
import pycountry

# List of country names (you can replace this with the actual country names if needed)
country_names = dist['Origin'].tolist()  # Extract country names from the dist DataFrame

# Create a dictionary to store country names and codes
country_code_dict = {}

# Iterate through the list of country names and get the ISO code
for country in country_names:
    try:
        country_obj = pycountry.countries.lookup(country)
        country_code_dict[country] = country_obj.alpha_3  # Use 'alpha_2' for 2-letter code
    except LookupError:
        country_code_dict[country] = None  # Assign None if country is not found

# Convert the dictionary to a DataFrame
country_codes_df = pd.DataFrame(list(country_code_dict.items()), columns=['Origin', 'code'])

# Merge the country codes DataFrame with the distances DataFrame
merged_df = pd.merge(dist, country_codes_df, on='Origin', how='left')
merged_df = merged_df.drop(columns=['Origin'])

In [89]:
merged_df

     Distance_km code
0          10542  AND
1           5583  ARE
2           4843  AFG
3          17054  ATG
4          17030  AIA
..           ...  ...
144        17107  MSR
145         9517  MLT
146         5564  MUS
147         3167  MDV
148         7716  MWI

[149 rows x 2 columns]

In [87]:
final_df = pd.merge(merged_df, bub, on='code', how='left')

In [90]:
final_df = final_df.dropna()

In [3]:
import pandas as pd
p=pd.read_csv("bubbleChart_pictograph.csv")

In [5]:
columns_to_drop = ['Unnamed: 0.1','Unnamed: 0']
df = p.drop(columns=columns_to_drop)
df.reset_index(drop=True, inplace=True)

In [ ]:
df

In [23]:
import re
import pandas as pd

def extract_data(html):
    rows = re.findall(r'<tr><td>(.*?)</td><td>(.*?)</td><td>', html)
    results = []
    for row in rows:
        match = re.search(r'Distance from (.*?) to (.*?)$', row[0])
        if match:
            origin, destination = match.groups()
            distance = row[1].split()[0]  # Extract just the number
            distance = distance.replace(',', '')  # Remove comma
            results.append((origin, destination, distance))
    return results

# Assuming the HTML content is stored in a variable called 'html_content'
data = extract_data(html_content)

# Create a DataFrame
df = pd.DataFrame(data, columns=['Origin', 'Destination', 'Distance_km'])

# Convert Distance_km to numeric type
df['Distance_km'] = pd.to_numeric(df['Distance_km'])

# Sort the DataFrame by distance
df = df.sort_values('Distance_km')

# Save to CSV
df.to_csv('distances_between_countries.csv', index=False)

print("Data has been saved to 'distances_between_countries.csv'")

# Display the first few rows of the DataFrame
print(df.head())

# Display some basic statistics
print(df.describe())

Data has been saved to 'distances_between_countries.csv'
       Origin                                        Destination  Distance_km
186  Malaysia  Singapore">Distance from Malaysia to Singapore...          378
111  Cambodia   Malaysia">Distance from Cambodia to Malaysia</a>          986
225  Malaysia     Vietnam">Distance from Malaysia to Vietnam</a>         1295
203  Malaysia   Thailand">Distance from Malaysia to Thailand</a>         1301
27     Brunei     Malaysia">Distance from Brunei to Malaysia</a>         1414
        Distance_km
count    250.000000
mean    9974.356000
std     4653.226482
min      378.000000
25%     6903.500000
50%     9338.000000
75%    12307.000000
max    19750.000000

In [24]:
df["Destination"]

186    Singapore">Distance from Malaysia to Singapore...
111     Malaysia">Distance from Cambodia to Malaysia</a>
225       Vietnam">Distance from Malaysia to Vietnam</a>
203     Thailand">Distance from Malaysia to Thailand</a>
27        Malaysia">Distance from Brunei to Malaysia</a>
                             ...
48     Malaysia">Distance from Costa Rica to Malaysia...
245         Panama">Distance from Malaysia to Panama</a>
47      Malaysia">Distance from Colombia to Malaysia</a>
162             Peru">Distance from Malaysia to Peru</a>
60       Malaysia">Distance from Ecuador to Malaysia</a>
Name: Destination, Length: 250, dtype: object

In [25]:
# Remove templates like '>Distance from Cambodia to Malaysia</a>'
df["Destination"] = df["Destination"].str.replace(r'>Distance from .* to .*</a>', '>', regex=True)
df["Destination"] = df["Destination"].str.replace(r'">', '', regex=False)  # Remove trailing '">'

# Display the DataFrame after removing the template
print("\nAfter removing template:")
print(df)

After removing template:
         Origin Destination  Distance_km
186    Malaysia   Singapore          378
111    Cambodia    Malaysia          986
225    Malaysia     Vietnam         1295
203    Malaysia    Thailand         1301
27       Brunei    Malaysia         1414
..          ...         ...          ...
48   Costa Rica    Malaysia        18338
245    Malaysia      Panama        18565
47     Colombia    Malaysia        18955
162    Malaysia        Peru        19369
60      Ecuador    Malaysia        19750

[250 rows x 3 columns]

In [26]:
df

         Origin Destination  Distance_km
186    Malaysia   Singapore          378
111    Cambodia    Malaysia          986
225    Malaysia     Vietnam         1295
203    Malaysia    Thailand         1301
27       Brunei    Malaysia         1414
..          ...         ...          ...
48   Costa Rica    Malaysia        18338
245    Malaysia      Panama        18565
47     Colombia    Malaysia        18955
162    Malaysia        Peru        19369
60      Ecuador    Malaysia        19750

[250 rows x 3 columns]

In [27]:
# Switch origin and destination where origin is "Malaysia"
df.loc[df['Origin'] == 'Malaysia', ['Origin', 'Destination']] = df.loc[df['Origin'] == 'Malaysia', ['Destination', 'Origin']].values
df

         Origin Destination  Distance_km
186   Singapore    Malaysia          378
111    Cambodia    Malaysia          986
225     Vietnam    Malaysia         1295
203    Thailand    Malaysia         1301
27       Brunei    Malaysia         1414
..          ...         ...          ...
48   Costa Rica    Malaysia        18338
245      Panama    Malaysia        18565
47     Colombia    Malaysia        18955
162        Peru    Malaysia        19369
60      Ecuador    Malaysia        19750

[250 rows x 3 columns]

In [28]:
import pandas as pd
import pycountry

# List of country names (you can replace this with the actual country names if needed)
country_names = df['Origin'].tolist()  # Extract country names from the dist DataFrame

# Create a dictionary to store country names and codes
country_code_dict = {}

# Iterate through the list of country names and get the ISO code
for country in country_names:
    try:
        country_obj = pycountry.countries.lookup(country)
        country_code_dict[country] = country_obj.alpha_3  # Use 'alpha_2' for 2-letter code
    except LookupError:
        country_code_dict[country] = None  # Assign None if country is not found

# Convert the dictionary to a DataFrame
country_codes_df = pd.DataFrame(list(country_code_dict.items()), columns=['Origin', 'code'])

# Merge the country codes DataFrame with the distances DataFrame
merged_df = pd.merge(df, country_codes_df, on='Origin', how='left')
merged_df = merged_df.drop(columns=['Origin'])

In [31]:
merged_df.drop('Destination', axis=1, inplace=True)
bubble=pd.read_csv("old_bubblechart.csv")

In [33]:
bubble=pd.read_csv("old_bubblechart.csv")

In [36]:
merged_df = pd.merge(bubble, merged_df, on='code', how='inner')

In [38]:
merged_df.to_csv("bubbleChart_pictograph.csv")

In [2]:
import pandas as pd
ga=pd.read_csv("grouped_arrivals.csv")
sub=pd.read_csv("subregion.csv")

In [4]:
ga.dropna(subset=['soe'], inplace=True)

In [10]:
sub.rename(columns={"alpha-3": "code"}, inplace=True)
sub = sub[["code", "name", "region", "sub-region"]]

In [12]:
df=pd.merge(ga, sub, on="code")

In [13]:
df.to_csv("grouped_arrivals.csv")

In [1]:
import pandas as pd

In [6]:
df = df.drop(df.columns[[0, 1]], axis=1)

In [9]:
grouped_df = df.groupby('soe').agg({
    'arrivals_male': 'sum',
    'arrivals_female': 'sum',
    'arrivals': 'sum'
}).reset_index()

print(grouped_df)

                soe  arrivals_male  arrivals_female    arrivals
0             Johor     22334867.0       17583695.0  39918562.0
1             Kedah      1622238.0        1031763.0   2654001.0
2          Kelantan       607108.0         562965.0   1170073.0
3            Melaka        63397.0          77261.0    140658.0
4   Negeri Sembilan       117076.0          63406.0    180482.0
5            Pahang         9990.0           8046.0     18036.0
6             Perak       227077.0         256268.0    483345.0
7            Perlis      1083957.0         638358.0   1722315.0
8      Pulau Pinang      1012922.0        1156062.0   2168984.0
9             Sabah       428031.0         504660.0    932691.0
10          Sarawak      2086092.0        1734256.0   3820348.0
11         Selangor     10026461.0        7278212.0  17304673.0
12       Terengganu          222.0             41.0       263.0
13      W.P. Labuan        30681.0          16836.0     47517.0

In [10]:
grouped_df.to_csv("sankey.csv")

In [11]:
df=pd.read_csv("bubbleChart_pictograph.csv")

In [12]:
df=df.drop_duplicates(subset='code')

In [13]:
df = df.drop(df.columns[[0, 1]], axis=1)

In [15]:
df.to_csv("bubbleChart_pictograph.csv")

In [1]:
import pandas as pd
df=pd.read_csv("sankey.csv")

In [8]:
df_melted = pd.melt(df, 
                    id_vars=['Unnamed: 0', 'soe'], 
                    value_vars=['arrivals_male', 'arrivals_female'], 
                    var_name='gender')

# Replace 'arrivals_male' and 'arrivals_female' with 'male' and 'female'
df_melted['gender'] = df_melted['gender'].replace({'arrivals_male': 'male', 'arrivals_female': 'female'})
df_melted=df_melted.drop(columns=["Unnamed: 0"])

In [15]:
import pandas as pd
df=pd.read_csv("grouped_arrivals.csv")

In [16]:
df["date"] = pd.to_datetime(df["date"])  # Convert 'date' column to datetime format
df["year"] = df["date"].dt.year

<ipython-input-16-b38de37f40e9>:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df["date"] = pd.to_datetime(df["date"])  # Convert 'date' column to datetime format

In [17]:
df = df.drop([df.columns[0], df.columns[1]], axis=1)

In [22]:
df = df.groupby(["year", "country", "latitude", "longitude", "region"])["arrivals"].sum().reset_index()

In [24]:
df.to_csv("grouped_arrivals.csv")